package com.mxy.common.core.enums;


/**
 * 公共操作返回编码
 *
 * @author
 * @description
 */
public enum ResponseCode {
    /**
     * 操作异常
     */
    RESP_9999(9999, "操作异常"),
    /**
     * 操作异常
     */
    RESP_9998(9998, "熔断异常"),
    /**
     * 操作成功
     */
    RESP_0(0, "操作成功"),

    /**
     * 操作失败
     */
    RESP_1(1, "操作失败"),
    /**
     * 错误代码
     */
    RESP_2(2, "未查询到记录"),
    /**
     * 图片验证码已过期
     */
    RESP_3(3, "图片验证码已过期"),
    /**
     * 图片验证码不正确
     */
    RESP_4(4, "图片验证码不正确"),
    /**
     * 参数不正确
     */
    RESP_5(5, "参数不正确"),
    /**
     * 图片上传失败，请稍后继续
     */
    RESP_6(6, "图片上传失败，请稍后继续"),
    /**
     * 参数不能为空
     */
    RESP_7(7, "参数不能为空"),
    /**
     * 文件类型
     */
    RESP_8(8, "文件类型不符合"),

    /**
     * 文件类型
     */
    RESP_9(9, "未上传文件"),

    /**
     * 文件类型
     */
    RESP_10(10, "上传文件数量过多"),

    RESP_11(11, "文件不存在"),
    /**
     * 文件类型
     */
    RESP_12(12, "文件超过20MB，请您重新选择"),
    /**
     * 文件类型
     */
    RESP_13(13, "文件总大小超过60MB，请您重新选择"),
    /**
     * 文件类型
     */
    RESP_14(14, "分公司不存在"),
    /**
     * 文件类型
     */
    RESP_15(15, "微信菜单创建服务调用异常"),

    /**
     * 文件类型
     */
    RESP_16(16, "微信access_token服务调用异常"),
    /**
     * 文件类型
     */
    RESP_17(17, "微信用户详情服务调用异常"),
    /**
     * 文件类型
     */
    RESP_18(18, "工单查询服务异常"),
    /**
     * 文件类型
     */
    RESP_19(19, "调用能力平台获取access_token异常"),


    /**
     * 文件类型
     */
    RESP_20(20, "调用能力平台获取access_token失败"),

    /**
     * 文件类型
     */
    RESP_21(21, "能力平台获取用户详情服务异常"),
    /**
     * 文件类型
     */
    RESP_22(22, "能力平台创建菜单服务异常"),

    /**
     * 文件类型
     */
    RESP_23(23, "能力平台授权服务异常"),
    /**
     * 文件类型
     */
    RESP_24(24, "授权获取手机号失败"),
    /**
     * 文件类型
     */
    RESP_25(25, "能力平台获取百度地图逆编码服务异常"),

    RESP_26(26,"您已超过催单次数，处理专员已经收到您的请求，正在加急处理中"),

    RESP_27(27,"您已经催单啦！处理专员已经收到您的请求，正在加急处理中"),

    RESP_28(28,"网络开小差啦!请您再试一次"),

    RESP_29(29,"催单成功，处理专员正在快马加鞭为您处理，请您耐心等待"),

    RESP_30(30,"内容补充成功"),

    RESP_31(31,"网络开小差啦!请您再试一次"),

    RESP_32(32,"您再稍等片刻，处理专员一般会在2个工作小时内与您联系，最晚不超过8工作小时"),

    RESP_33(33,"用户未评价"),

    RESP_34(34,"超过提交补充次数，如您有紧急问题需要补充可耐心等待处理专员与您联系"),

    RESP_35(35,"您再稍等片刻，处理专员一般会在2工作小时内与您联系，最晚不超过8工作小时"),

    RESP_36(36,"您好，请勿重复点击"),

    RESP_37(37,"您好，您的链接已失效"),

    RESP_38(38, "非法操作"),

    RESP_39(39, "在途工单，不允许操作"),

    RESP_40(40, "统一接口平台用户简单查询失败"),

    RESP_41(41, "更新工单状态失败，请稍后重试"),

    RESP_42(42, "更新的工单不存在，请重新确认"),

    RESP_43(43, "openId不能为空"),

    RESP_44(44, "获取token失败"),

    RESP_45(45, "评价失败"),

    RESP_46(46, "工单已评价，不能进行更新评价字段操作"),

    RESP_47(47, "调用能力平台获取jsapi_ticket失败"),

    RESP_48(48, "调用能力平台获取jsapi_ticket异常"),

    RESP_49(49, "权限校验失败"),

    RESP_50(50, "合力删除工单失败"),

    RESP_51(51, "手机验证码不能为空"),

    RESP_52(52, "手机号不能为空"),

    RESP_53(53, "手机验证码不能为空"),

    RESP_54(54, "手机验证码长度不对"),

    RESP_55(55, "手机验证码已过期"),

    RESP_57(57, "短信验证码不正确"),

    RESP_56(56, "非联通手机号"),

    RESP_58(58, "图片验证码不正确"),

    RESP_59(59, "Token 过期,请登录!"),

    RESP_60(60, "Token 无效,请登录!"),

    RESP_61(61, "请登录!"),

    RESP_62(62, "手机号长度不对"),

    RESP_63(63, "临时token不能为空"),

    RESP_64(64, "Token 无效"),

    RESP_65(65, "签名不能为空"),

    RESP_66(66, "渠道不能为空"),

    RESP_67(67, "客户端id不能为空"),

    RESP_68(68, "签名错误"),

    RESP_69(69, "密文错误"),

    RESP_70(70, "错误次数超过5次，请10分钟后再登录"),

    RESP_71(71, "投诉平台仅支持 手机号 、 固话 、 宽带登录"),

    RESP_72(72, "生成签名异常"),

    RESP_74(74, "手机号码被篡改"),

    RESP_73(73, "重定向地址不能为空"),

    RESP_75(75, "必填参数不能为空"),

    RESP_76(76, "争议赔付金额不能为负"),

    RESP_77(77, "手机流量费金额不能为负"),

    RESP_78(78, "调用统一接口平台获取token公共模块失败"),

    RESP_79(79, "存在正在处理中的投诉工单"),

    RESP_80(80, "同步合力评价信息失败"),

    RESP_81(81, "能力平台物联网工单服务异常"),

    RESP_82(82, "调用能力平台获取物联网卡信息异常"),

    RESP_83(83, "调用能力平台获取物联网账户信息异常"),

    RESP_84(84, "调用工单体系文件上传接口失败！"),

    RESP_85(85, "调用统一接口平台实名制校验接口异常"),

    RESP_86(86, "调用记录复制投诉编码动作接口异常"),

    RESP_87(87, "非常抱歉，您已经提交一张不满意再次投诉工单，无法再次点击提交！"),

    RESP_88(88, "工单提交基地失败！"),

    RESP_89(89, "调用能开的沃信用积分查询接口失败！"),

    RESP_90(90, "调用合力查询客服列表接口失败！"),

    RESP_91(91,"您当前暂无可查询的投诉单"),

    RESP_92(92,"您当前暂无待处理或处理中的投诉单"),

    RESP_93(93,"不可重复立单");

    private int code;
    /**
     * 错误信息
     */
    private String msg;

    ResponseCode(int code, String msg) {
        this.code = code;
        this.msg = msg;
    }

    public int getCode() {
        return this.code;
    }


    public String getMsg() {
        return this.msg;
    }

    private ResponseCode() {

    }
}
